Revit 2027 API
WallType.ThermalProperties Property
 The calculated and settable thermal properties of the WallType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ThermalProperties ThermalProperties { get; }
Public ReadOnly Property ThermalProperties As ThermalProperties
	Get
public:
property ThermalProperties^ ThermalProperties {
	ThermalProperties^ get ();
}
member ThermalProperties : ThermalProperties with get
Property Value
ThermalProperties
Remarks
 Returns null if the wall has no thermal properties. Curtain walls and stacked walls do not store thermal properties.
See Also
Reference
WallType Class
Autodesk.Revit.DB Namespace